; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v2 ?v5)
             (pred_5 ?v1 ?v9)
             (pred_11 ?v2 ?v9)
             (pred_1 ?v12 ?v2 )
	     (pred_6 ?v2)
             (pred_9 ?v7)
             (pred_2 ?v1)
             (pred_10 ?v9)
             (pred_12 ?v2)
             (pred_7 ?v1)
             (pred_3 ?v2)
             (pred_8 ))



(:action op_5
:parameters (?v4 ?v6 ?v8 ?v3)
:precondition (and (pred_9 ?v4) (pred_9 ?v6) (pred_2 ?v8) (pred_10 ?v3)
          (pred_4 ?v4 ?v6) (pred_5 ?v8 ?v3)
                   (pred_11 ?v6 ?v3) (pred_6 ?v4) 
                   (pred_12 ?v6) (pred_7 ?v8))
:effect (and  (pred_3 ?v6) (not (pred_12 ?v6))))


(:action op_3
:parameters (?v4 ?v11)
:precondition (and (pred_9 ?v4) (pred_9 ?v11)
               (pred_6 ?v4) (pred_4 ?v4 ?v11) (pred_3 ?v11))
:effect (and (pred_6 ?v11) (not (pred_6 ?v4))))

(:action op_1
:parameters (?v4 ?v8)
:precondition (and (pred_9 ?v4) (pred_2 ?v8) 
                  (pred_6 ?v4) (pred_1 ?v8 ?v4) (pred_8 ))
:effect (and (pred_7 ?v8)
   (not (pred_1 ?v8 ?v4)) (not (pred_8 ))))


(:action op_4
:parameters (?v4 ?v13 ?v10)
:precondition (and (pred_9 ?v4) (pred_2 ?v13) (pred_2 ?v10)
                  (pred_6 ?v4) (pred_7 ?v10) (pred_1 ?v13 ?v4))
:effect (and (pred_7 ?v13) (pred_1 ?v10 ?v4)
        (not (pred_7 ?v10)) (not (pred_1 ?v13 ?v4))))

(:action op_2
:parameters (?v4 ?v8)
:precondition (and (pred_9 ?v4) (pred_2 ?v8) 
                  (pred_6 ?v4) (pred_7 ?v8))
:effect (and (pred_8 ) (pred_1 ?v8 ?v4) (not (pred_7 ?v8)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_10 obj_18 obj_30 obj_08 obj_26 obj_11 obj_22 obj_21 obj_28 obj_09 obj_32 obj_06 obj_05 obj_31 obj_27 obj_19 obj_23 obj_01 obj_29 obj_17 obj_24 obj_12 obj_16 obj_25 obj_15
    obj_02 obj_20 obj_04
    obj_03 obj_07 obj_13 obj_14
    )

    (:init
       (pred_8)

       (pred_9 obj_10)
       (pred_9 obj_18)
       (pred_9 obj_30)
       (pred_9 obj_08)
       (pred_9 obj_26)
       (pred_9 obj_11)
       (pred_9 obj_22)
       (pred_9 obj_21)
       (pred_9 obj_28)
       (pred_9 obj_09)
       (pred_9 obj_32)
       (pred_9 obj_06)
       (pred_9 obj_05)
       (pred_9 obj_31)
       (pred_9 obj_27)
       (pred_9 obj_19)
       (pred_9 obj_23)
       (pred_9 obj_01)
       (pred_9 obj_29)
       (pred_9 obj_17)
       (pred_9 obj_24)
       (pred_9 obj_12)
       (pred_9 obj_16)
       (pred_9 obj_25)
       (pred_9 obj_15)
       (pred_10 obj_02)
       (pred_10 obj_20)
       (pred_10 obj_04)
       (pred_2 obj_03)
       (pred_2 obj_07)
       (pred_2 obj_13)
       (pred_2 obj_14)

       (pred_4 obj_10 obj_11)
       (pred_4 obj_10 obj_18)
       (pred_4 obj_18 obj_22)
       (pred_4 obj_18 obj_30)
       (pred_4 obj_18 obj_10)
       (pred_4 obj_30 obj_21)
       (pred_4 obj_30 obj_08)
       (pred_4 obj_30 obj_18)
       (pred_4 obj_08 obj_28)
       (pred_4 obj_08 obj_26)
       (pred_4 obj_08 obj_30)
       (pred_4 obj_26 obj_09)
       (pred_4 obj_26 obj_08)
       (pred_4 obj_11 obj_32)
       (pred_4 obj_11 obj_22)
       (pred_4 obj_11 obj_10)
       (pred_4 obj_22 obj_06)
       (pred_4 obj_22 obj_21)
       (pred_4 obj_22 obj_18)
       (pred_4 obj_22 obj_11)
       (pred_4 obj_21 obj_05)
       (pred_4 obj_21 obj_28)
       (pred_4 obj_21 obj_30)
       (pred_4 obj_21 obj_22)
       (pred_4 obj_28 obj_31)
       (pred_4 obj_28 obj_09)
       (pred_4 obj_28 obj_08)
       (pred_4 obj_28 obj_21)
       (pred_4 obj_09 obj_27)
       (pred_4 obj_09 obj_26)
       (pred_4 obj_09 obj_28)
       (pred_4 obj_32 obj_19)
       (pred_4 obj_32 obj_06)
       (pred_4 obj_32 obj_11)
       (pred_4 obj_06 obj_23)
       (pred_4 obj_06 obj_05)
       (pred_4 obj_06 obj_22)
       (pred_4 obj_06 obj_32)
       (pred_4 obj_05 obj_01)
       (pred_4 obj_05 obj_31)
       (pred_4 obj_05 obj_21)
       (pred_4 obj_05 obj_06)
       (pred_4 obj_31 obj_29)
       (pred_4 obj_31 obj_27)
       (pred_4 obj_31 obj_28)
       (pred_4 obj_31 obj_05)
       (pred_4 obj_27 obj_17)
       (pred_4 obj_27 obj_09)
       (pred_4 obj_27 obj_31)
       (pred_4 obj_19 obj_24)
       (pred_4 obj_19 obj_23)
       (pred_4 obj_19 obj_32)
       (pred_4 obj_23 obj_12)
       (pred_4 obj_23 obj_01)
       (pred_4 obj_23 obj_06)
       (pred_4 obj_23 obj_19)
       (pred_4 obj_01 obj_16)
       (pred_4 obj_01 obj_29)
       (pred_4 obj_01 obj_05)
       (pred_4 obj_01 obj_23)
       (pred_4 obj_29 obj_25)
       (pred_4 obj_29 obj_17)
       (pred_4 obj_29 obj_31)
       (pred_4 obj_29 obj_01)
       (pred_4 obj_17 obj_15)
       (pred_4 obj_17 obj_27)
       (pred_4 obj_17 obj_29)
       (pred_4 obj_24 obj_12)
       (pred_4 obj_24 obj_19)
       (pred_4 obj_12 obj_16)
       (pred_4 obj_12 obj_23)
       (pred_4 obj_12 obj_24)
       (pred_4 obj_16 obj_25)
       (pred_4 obj_16 obj_01)
       (pred_4 obj_16 obj_12)
       (pred_4 obj_25 obj_15)
       (pred_4 obj_25 obj_29)
       (pred_4 obj_25 obj_16)
       (pred_4 obj_15 obj_17)
       (pred_4 obj_15 obj_25)
       (pred_12 obj_09)
       (pred_12 obj_01)
       (pred_12 obj_08)
       (pred_12 obj_26)
       (pred_11  obj_09 obj_02)
       (pred_11  obj_01 obj_20)
       (pred_11  obj_08 obj_04)
       (pred_11  obj_26 obj_02)
       (pred_3 obj_10)
       (pred_3 obj_18)
       (pred_3 obj_30)
       (pred_3 obj_11)
       (pred_3 obj_22)
       (pred_3 obj_21)
       (pred_3 obj_28)
       (pred_3 obj_32)
       (pred_3 obj_06)
       (pred_3 obj_05)
       (pred_3 obj_31)
       (pred_3 obj_27)
       (pred_3 obj_19)
       (pred_3 obj_23)
       (pred_3 obj_29)
       (pred_3 obj_17)
       (pred_3 obj_24)
       (pred_3 obj_12)
       (pred_3 obj_16)
       (pred_3 obj_25)
       (pred_3 obj_15)

       (pred_5  obj_03 obj_02)
       (pred_5  obj_07 obj_20)
       (pred_5  obj_13 obj_04)
       (pred_5  obj_14 obj_04)
       (pred_1 obj_03 obj_16)
       (pred_1 obj_07 obj_15)
       (pred_1 obj_13 obj_30)
       (pred_1 obj_14 obj_17)
       (pred_6 obj_21)
    )

    (:goal (and
       (pred_1 obj_07 obj_21)
    ))
(:constraints
  (always (not (pred_6 obj_31)))
)
)

; plan
1. (op_3 obj_21 obj_05)
   deleted: (pred_6 obj_21)
   added: (pred_6 obj_05)
   goals met: 0 of 1
2. (op_3 obj_05 obj_06)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_06)
   goals met: 0 of 1
3. (op_3 obj_06 obj_23)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_23)
   goals met: 0 of 1
4. (op_3 obj_23 obj_12)
   deleted: (pred_6 obj_23)
   added: (pred_6 obj_12)
   goals met: 0 of 1
5. (op_3 obj_12 obj_16)
   deleted: (pred_6 obj_12)
   added: (pred_6 obj_16)
   goals met: 0 of 1
6. (op_3 obj_16 obj_25)
   deleted: (pred_6 obj_16)
   added: (pred_6 obj_25)
   goals met: 0 of 1
7. (op_3 obj_25 obj_15)
   deleted: (pred_6 obj_25)
   added: (pred_6 obj_15)
   goals met: 0 of 1
8. (op_1 obj_15 obj_07)
   deleted: (pred_1 obj_07 obj_15) (pred_8)
   added: (pred_7 obj_07)
   goals met: 0 of 1
9. (op_3 obj_15 obj_17)
   deleted: (pred_6 obj_15)
   added: (pred_6 obj_17)
   goals met: 0 of 1
10. (op_3 obj_17 obj_29)
   deleted: (pred_6 obj_17)
   added: (pred_6 obj_29)
   goals met: 0 of 1
11. (op_5 obj_29 obj_01 obj_07 obj_20)
   deleted: (pred_12 obj_01)
   added: (pred_3 obj_01)
   goals met: 0 of 1
12. (op_3 obj_29 obj_01)
   deleted: (pred_6 obj_29)
   added: (pred_6 obj_01)
   goals met: 0 of 1
13. (op_3 obj_01 obj_05)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_05)
   goals met: 0 of 1
14. (op_3 obj_05 obj_21)
   deleted: (pred_6 obj_05)
   added: (pred_6 obj_21)
   goals met: 0 of 1
15. (op_2 obj_21 obj_07)
   deleted: (pred_7 obj_07)
   added: (pred_8) (pred_1 obj_07 obj_21)
   goals met: 1 of 1
